[M_Ep3_CatchARide MissionDefinition]
MissionDescription="[A holy place]. The last independent city on Pandora. Between the walls you will find Roland, the leader of the resistance, and handsome Jack.. You have security; Some people are calm and do not give the first opportunity to fire a gun.."

[M_Ep3_CatchARide:AcquireNetworkInterfaceSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="[place ] shelter [-place]. Pandora is the most independent city.. Inside the wall you will find Roland. Handsome Jack is the leader of the resistance. The war between the bandit tribe and Sanctuary [-Ako]] has put you on the other side of a broken road.. The Guardian Angel suggested grabbing a vehicle from the nearby Catch-A-Ride station so you can jump over the destroyed ramp and drive to [place ] shelter [-place], but you've hit a snag: the Catch-A-Ride has locked you out. Good news, maybe the angels are smiling on you.. the bad news is that Catch-A-Ride isn't Hyperion technology, so you'll need a Hyperion adapter to connect.. good news. Bloodshot and Hyperion Adapter are next.. Angela asks you to answer.."

[M_Ep3_CatchARide:DeliverPowerSupplySet MissionObjectiveSetDefinition]
MissionDescriptionOverride="[Place] Temple [ Place]. The last free city in Pandora. Within the walls, you will find Roland, the merciless leader against Jack.. You have passed through the outer gate of the temple.. However, to enter the Guardian, you must power up the [location] holy [-location] protection generator.. you know. do it."

[M_Ep3_CatchARide:FindECHOSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="[Location] Residence [-Location]. Pandora's Last Free City. Within these walls You will meet Roland. war chief Along with the handsome Jack. while trying to enter the city You met Roland. Leader of the Red Rider Resistance. He says his friend Corporal Rice is trying to find new troops for Wing [place] Fidyard [place] .. According to Roland, after finding the head and heart His people will take you [on a pilgrimage].."

[M_Ep3_CatchARide:GetPowerSupplySet MissionObjectiveSetDefinition]
MissionDescriptionOverride="[Location [Temple] - Location]. The last independent city on Pandora. Inside these walls you will meet Roland, the handsome Jack, the leader of the resistance. As you attempt to enter the city, you encounter Roland, the leader of the Crimson Rider resistance.. He mentioned that his friend was trying to find a new power source for Corporal Rice Shield's secret hideout [location] [location].. I found the director - he says that while he was breathing, a group of criminals stole his strong heart.. You must find them, destroy them and capture their essence.."

[M_Ep3_CatchARide:InstallNetworkInterfaceSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Connect the Hyperion adapter to the Catch-A-Ride.."
MissionDescriptionOverride="[Place [Book] Place]. The last free city on Pandora. Inside the wall, you'll find Roland, the leader of the fight against Handsome Jack.. A battle between Blood Arrows and a Guardian (location) leaves you on the wrong side of a broken cliff.. The Guardian Angel Catch-A-Ride has a Hyperion adapter that allows it to bypass firewalls. Once the Hyperion adapter is connected, Angel can arrange the sale for you and provide you with a vehicle to travel abroad. On the slope."

[M_Ep3_CatchARide:InstallPowerSupplySet MissionObjectiveSetDefinition]
MissionDescriptionOverride="You built the temple and brought back the weapons.. With Roland gone, the [a]Sanctuary[-place] Crimson Raiders still need your help.."

[M_Ep3_CatchARide:JumpRampSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="[place] refuge [-place]. The last empty city is Pandora. We see Roland, the leader of the resistance, against the good jack on the wall.. Now that you've got a car, it's smooth sailing to [place] refuge [-place]. suitable to do."

[M_Ep3_CatchARide:SanctuaryOuterGate MissionObjectiveSetDefinition]
MissionDescriptionOverride="[sacred place]. The last white city is Pandora.. On the wall you can see Roland holding a Fair Jack.. As he attempts to enter the city, he meets Roland, the leader of the Red Knights.. He tells them that fellow spy Offred Reese is trying to obtain new information about the [Earth] [-Habitat] SHIELD facility.. He tracks down Reese and finds himself killed by a bloodthirsty gang, but manages to find a strong base.. You must return to the [earthly] gates of the Holy Land [-world].."

[M_Ep3_CatchARide:TalkToRolandAtGateSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="[Location: Church]. The ultimate free Pandora city. Within these walls is the leader of Handsome Jack's resistance, Roland.. The patron saint asked us to use the intercom at the entrance of the temple.. After talking to the doorman you should be allowed to enter.."

[M_Ep3_CatchARide:UseCatchARideSet1 MissionObjectiveSetDefinition]
MissionSummaryOverride="Go for a ride."
MissionDescriptionOverride="[Location] Santo [Location]. The last free city of Pandora,. Inside the wall you'll see Roland, Jack's good fight leader.. Fighting between a local gang and another local security guard ended when a road broke down.. The Guardian Angel has suggested grabbing a vehicle from the nearby Catch-A-Ride station so you can jump over the destroyed ramp and drive to [Location] Santo [Location]."

[M_Ep3_CatchARide:UseCatchARideUnlocked MissionObjectiveSetDefinition]
MissionSummaryOverride="what are you driving."
MissionDescriptionOverride="[location] location [-location]. The last free city is Pandora.. On the wall you will find Roland, who leads the fight against Handsome Jack.. The battle between bloodthirsty criminals and doormen [location] [location] will lead you to the destroyed streets.. The Guardian Angel has suggested grabbing a vehicle from the nearby Catch-A-Ride station so you can jump over the destroyed ramp and drive to [location] location [-location]."

[M_Ep3_CatchARide:UseLockedCatchARide MissionObjectiveDefinition]
ProgressMessage="Use speed."
